Revit 2027 API
RebarContainer.RemoveItem Method
 Removes Item from the Rebar Container.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveItem(
	RebarContainerItem pItem
)
Public Sub RemoveItem (
	pItem As RebarContainerItem
)
public:
void RemoveItem(
	RebarContainerItem^ pItem
)
member RemoveItem :
        pItem : RebarContainerItem -> unit
Parameters
pItem RebarContainerItem
 Item to be removed from this Rebar Container
Exceptions
Exception | Condition
ArgumentException |  The item is not a member of this Rebar Container element.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace